In [99]:
# import libraries
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# Import titanic dataset
titanic_data = pd.read_csv("titanic_data.csv") 
titanic_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1309 non-null   object
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1309 non-null   object
 9   cabin      1309 non-null   object
 10  embarked   1309 non-null   object
 11  boat       1309 non-null   object
 12  body       1309 non-null   object
 13  home.dest  1309 non-null   object
dtypes: int64(4), object(10)
memory usage: 143.3+ KB

In [100]:
titanic_data['age'] = pd.to_numeric(titanic_data['age'], errors = 'coerce')
grouped = titanic_data.groupby("age")['age'].count()
grouped

age
0.1667     1
0.3333     1
0.4167     1
0.6667     1
0.7500     3
          ..
70.5000    1
71.0000    2
74.0000    1
76.0000    1
80.0000    1
Name: age, Length: 98, dtype: int64

In [101]:
grouped[21]

41

In [2]:
titanic_data['age'] = pd.to_numeric(titanic_data['age'], errors = 'coerce')
titanic_data.dropna(inplace = True)
titanic_data = titanic_data[titanic_data['age'] > 1]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0,0,0,24160,211.3375,B5,S,2,?,"St Louis, MO"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0,1,2,113781,151.55,C22 C26,S,?,135,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48.0,0,0,19952,26.55,E12,S,3,?,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S,10,?,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0,A36,S,?,?,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S,D,?,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,?,C,?,22,"Montevideo, Uruguay"
10,1,0,"Astor, Col. John Jacob",male,47.0,1,0,PC 17757,227.525,C62 C64,C,?,124,"New York, NY"

In [3]:
titanic_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1024 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1024 non-null   int64
 1   survived   1024 non-null   int64
 2   name       1024 non-null   object
 3   sex        1024 non-null   object
 4   age        1024 non-null   float64
 5   sibsp      1024 non-null   int64
 6   parch      1024 non-null   int64
 7   ticket     1024 non-null   object
 8   fare       1024 non-null   object
 9   cabin      1024 non-null   object
 10  embarked   1024 non-null   object
 11  boat       1024 non-null   object
 12  body       1024 non-null   object
 13  home.dest  1024 non-null   object
dtypes: float64(1), int64(4), object(9)
memory usage: 120.0+ KB

## Statistics Review

Creating a histogram

In [ ]:
# Create a histogram
_ = plt.hist(titanic_data['age'], bins=10 )
_ = plt.xlabel('age')
_ = plt.ylabel('number of people')
fig = plt.gcf()
fig.set_size_inches(10, 5)

- Note that the histogram is very hard to read
- Note that plt.hist returns 3 arrays, but we only want a plot therefore we assign these to a dummy variable _
- The number of bins and thier size was assigned automatically by the default settings of plt.hist()
- we can specify the bins to modify the plot and make it more readable

In [ ]:
titanic_data.describe()

In [ ]:
# calculate percentiles
age_percentiles = np.percentile(titanic_data['age'], [25, 50, 75])

# Print the result
print(age_percentiles)

In [ ]:
# Graph the box plot the age data

# import seaborn

# Create box plot with Seaborn's default settings
_ = sns.boxplot(x='age',data=titanic_data)

# Label the axes
_ = plt.xlabel('age')

#ax = sns.boxplot(x=tips["total_bill"])

# Show the plot
plt.show()

In [ ]:
### Outliers

In [ ]:
# Remove outliers
df_no_outliers = titanic_data[titanic_data['age'] < 65]

# Calculate mean
df_no_outliers.describe()

In [ ]:
# Create a new histogram
_ = plt.hist(df_no_outliers['age'], bins=10)
_ = plt.xlabel('age')
_ = plt.ylabel('number of people')
fig = plt.gcf()
fig.set_size_inches(10, 5)

In [ ]:
### Missing Values

In [ ]:
# Remove age 29 and replace with nan
# First define a series with that has all values that equal 29 replaced with nan
#df_no_outliers.loc[df_no_outliers[df_no_outliers['age']==29]] = np.nan
age_wo_29 = titanic_data['age'].replace(29, np.nan)

# Add the newly defined series as a column in our titanic dataframe
df_no_outliers['age'] = age_wo_29

df_no_outliers.head(100)

In [ ]:
# calculate new statistics
df_no_outliers.describe()

In [ ]:
### Date Time

In [ ]:
# Import datetime
import datetime as dt

# Import data with datetime (appointment data from a doctor's office)
date_df = pd.read_csv("datetime_data.csv")
date_df.head()

In [ ]:
date_df.info()

In [ ]:
- Note that date features like "AppointmentDay" and "ScheduledDay" seem to be "object" instead of date time.
- This is the case beause  pandas is currently looking at these values as strings instead of dates
- To convert these features into datetime we cans simply use the pandas function to_datetime

In [ ]:
# Convert AppointmentDay into datetime
date_df['AppointmentDay'] = pd.to_datetime(date_df['AppointmentDay'])

# Convert AppointmentDay into datetime
date_df['ScheduledDay'] = pd.to_datetime(date_df['AppointmentDay'])

date_df.info()

Now that you have these values with datetime type, you can use them to create a better analysis.
- datetime64 has several properties in pandas that we can now use 

link:https://pandas.pydata.org/pandas-docs/version/0.23/api.html#datetimelike-properties

In [ ]:
# Create a new field that tells us the year in which each appointment was set
date_df['year_set'] = date_df['ScheduledDay'].dt.year

# Create a new field that tells us which day of the year the appointment was set
date_df['day_num'] = date_df['ScheduledDay'].dt.dayofyear

date_df.sort_values(by=['Age']).head(26)